app/controllers/tweets_controller.rb

  def updated
    @queued_tweets = Tweet.find(:all, :conditions => ["tweet_id > ?", params[:since]], :order => "sent_at desc")
---
SELECT * FROM "tweets" WHERE (tweet_id > 'undefined') ORDER BY sent_at desc